
# Курсы криптовалют (в свагах за 1 единицу)
CRYPTO_RATES = {
    "BL": 880000,  # 1 Бликс = 84,000 сваги (привязка к BTC ≈ $84,000)
    "DP": 3610,    # 1 Дрип = 3,610 сваги (привязка к TON ≈ $3.61)
    "LK": 1000     # 1 ЛиркаКойн = 1000 сваги (начальная цена)
}

MULTIPLIER_COSTS = {
    2: 500_000,
    3: 1_000_000,
    4: 2_000_000,
    5: 4_000_000,
    10: 10_000_000,
    25: 25_000_000,
    50: 50_000_000,
    100: 100_000_000
}

# Ранги и лиги
RANKS = {
    1000: "Нуб 👶",
    2000: "Нормис 🧑",
    5000: "На пути к успеху 🚀",
    10000: "Джигернаут 🦸",
    20000: "На дрипе 🕶️",
    30000: "Модник в классе 👔",
    50000: "Илон докс 🚗",
    100000: "Свага имеется 💼",
    200000: "Глава Тиктока 📱",
    500000: "САМЫЙ МОДНЫЙ В ШКОЛЕ 🏫",
    1000000: "ВЕЛИЧАЙШИЙ В ДРИПЕ 👑",
    10000000: "ПОВЕЛИТЕЛЬ СВАГИ 🛡️"
}

LEAGUES = {
    "Лига Нормисов 🏅": {"cost": 0, "min": 2, "max": 5},
    "Лига Дрипа 🕶️": {"cost": 100000, "min": 5, "max": 10},
    "Лига Nameles 🌌": {"cost": 250000, "min": 10, "max": 15},
    "Лига Гранд Сваги 💎": {"cost": 500000, "min": 15, "max": 20},
    "ЛИГА СВАГИ 🚀": {"cost": 1000000, "min": 20, "max": 50},
    "Лига величия 👑": {"cost": 5000000, "min": 50, "max": 100},
    "Лига Титанов 🗿": {"cost": 10000000, "min": 100, "max": 200},
    "Лига Божеств 👼": {"cost": 25000000, "min": 200, "max": 500},
    "Лига Абсолютного Превосходства ⚡": {"cost": 50000000, "min": 500, "max": 1000},
    "Лига Вечных Знаменитостей 🌟": {"cost": 100000000, "min": 1000, "max": 5000},
    "Лига Легендарных Королей 👑✨": {"cost": 500000000, "min": 5000, "max": 10000}
}

# Множители
MULTIPLIERS = {
    "❄Х2": 1000,
    "♦Х3": 2000,
    "💠Х5": 5000,
    "🌲Х10": 15000,
    "⚜Х20": 30000,
    "⚠Х50": 70000,
    "🚩Х100": 150000,
}

# Фермы
FARMS = {
    "Ферма Дрипа 🌾": {"cost": 100000, "income": 1000},
    "Ферма Майнер ⛏️": {"cost": 500000, "income": 5000},
    "Ферма мобов 👾": {"cost": 1000000, "income": 10000},
    "Ферма сваги 💰": {"cost": 5000000, "income": 50000},
    "Ферма Мультивселенной ⚫": {"cost": 50000000, "income": 100000}
}